[
  "Tue 04 Feb, 2025 - 4:07 PM ET\nFitch Ratings - Rio de Janeiro - 04 Feb 2025: Fitch Ratings has affirmed Engie Brasil Energia S.A.'s (Engie Brasil) Foreign Currency (FC) and Local Currency (LC) Long-Term Issuer Default Ratings (IDRs) at 'BB+' and 'BBB-', respectively. Fitch has also affirmed Engie Brasil's Long-Term National Scale Rating and its senior unsecured debenture issuances at 'AAA(bra)'. The Rating Outlook for corporate ratings is Stable.\nEngie Brasil's ratings reflect its prominent market position as the second-largest electric energy generation company in Brazil, with a sizable, diversified asset base and operational efficiency. The company's credit profile also benefits from a track record of robust operating cash flow generation and a solid financial profile, with moderate leverage and strong financial flexibility.\nFitch believes Engie Brasil is prepared to manage its high capex plan, despite the challenges from expected lower prices for its uncontracted energy in the coming years. Engie Brasil's FC IDR is constrained by Brazil's Country Ceiling of 'BB+', while Brazil's operating environment anchors the LC IDR. Robust Business Profile: Engie Brasil's ratings benefit from a strong business position in the electric power generation segment in Brazil. It is the second-largest energy generation company in the country, with a total installed capacity of 9.3 GW, to be expanded to 10.7GW in 2025 with the conclusion of new projects. The company has a successful track record in its commercial strategy and monthly allocation of assured capacity. It also benefits from the diluted operational risks due to its diversified asset base.\nThe transmission segment provides further diversification and improves predictability to operating cash flow. Engie Brasil has 2,710 km of transmission lines in operation and 1,780 km under development, to be concluded by 2029. Permitted annual revenues of BRL771 million in this segment should represent roughly 10% of consolidated EBITDA in 2025.\nHigh Capex Pressures FCF: The base case scenario for the ratings considers high investments of BRL8.3 billion, mainly concentrated in 2025, and strong dividend distribution, which will pressure Engie Brasil's FCF. Fitch estimates EBITDA of BRL6.9 billion in 2025 and BRL7.0 billion in 2026, and cash flow from operations (CFFO) of BRL4.1 billion in 2025 and BRL4.0 billion in 2026, with negative FCF of BRL1.9 billion in 2025 and positive FCF of BRL190 million in 2026. Fitch expects the EBITDA margin to increase over the next few years, reaching 65% in 2025, due to reduced energy purchase expenses with the new generation projects conclusion. The base case scenario anticipates sales of 4.7 average GW (aGW) in 2025 and 4.8 aGW in 2026, with average tariffs of BRL232/MWh and BRL226/MWh, respectively.\nLeverage Expected to Peak in 2025: Fitch estimates Engie Brasil's net leverage ratio will reach 3.2x in 2025, up from 2.3x in 2023 and an expected 3.0x in 2024. These ratios remain consistent with the current LC IDR. A reduction in dividends received from Transportadora Associada de Gás S.A. (TAG) to roughly BRL151 million in 2025 from BRL583 million in 2024 will negatively affect leverage ratios in 2025.\nThe net debt-to-EBITDA ratio should begin to approach 3.0x from 2026 onward. The company has a positive track record in capital structure management, which has included reducing dividend distribution in the past. Manageable Hydrologic and Curtailment Risks: Fitch estimates Engie Brasil's uncontracted energy volumes of 16% in 2025 and 19% in 2026 would be sufficient to support the expected generating scaling factor (GSF) of 0.89 and 0.91 in the same years, respectively. If needed, Engie Brasil has to obtain energy purchase contracts at prices compatible with those established in sales contracts to cover the reduction in its own generation to avoid higher negative impacts on cash generation.\nThe company has protection against hydrological risk in contracts in the regulated market, which represents approximately 35% of the energy sold and limits its assured energy exposure to GSF to 31%. A diversified asset base also mitigates curtailment impact, with 10% constrained off in renewables plants considered manageable for the group.\nExposure to Repricing and Concession Risk in the Medium Term: Engie Brasil's uncontracted position above 35% from 2028 onward represents a pricing risk in the medium term. The base case scenario for the ratings incorporates average prices of BRL210/MWh for new contracts from 2028 onward, less than BRL256/MWh for the current contracts.\nIn addition, important concessions, which totals 3.9GW and represents 43% of the company current installed capacity, expire during 2030-2032. Fitch believes the group still has time to manage these exposures and expects potential impacts in the cash flow, capital structure or liquidity position to be addressed in advance. Weak Parent-Subsidiary Linkage: Engie Brasil's ratings are based on its Standalone Credit Profile, as legal, operational and strategic incentives for parent company Engie S.A. (Engie, BBB+/Stable) to support the Brazilian subsidiary, if needed, are weak. Engie controls 68.71% of Engie Brasil, but there are no guarantees or cross-default clauses.\nStrategic incentives of support are low as Engie Brasil represents less than 10% of the group's EBITDA despite being the largest market outside Europe and having some growth potential. Fitch views operational incentives as low to medium, with some reputational risks related to the use of a common name. Engie Brasil's FC IDR (BB+/Stable) is one to two notches below peers in Latin America, such as Engie Energia Chile S.A. (Engie Chile; BBB/Stable), the fourth-largest generator in Chile; Enel Colombia S.A. E.S.P. (Enel Colombia; BBB/Stable), the second-largest generation company in Colombia; and AES Andes S.A. (AES Andes; BBB-/Stable), the second-largest generator in Chile and one of the leaders in Colombia. This is primarily as a result of Brazil's 'BB+' Country Ceiling.\nEngie Chile, Enel Colombia and AES Andes benefit from better economic environments in Chile and Colombia, which are rated higher than Brazil. Engie Brasil's FC IDR is capped by the Brazilian Country Ceiling.\nEngie Brasil's LC IDR (BBB-/Stable) is more comparable with these 'BBB' category rated peers. It is well positioned relative to other Latin American power generators in terms of installed capacity, asset diversification and contracted position. Engie Brasil has an installed capacity of approximately 9.3GW, which compares favorably with AES Andes (6.1GW), Engie Chile (2.5GW) and Enel Colombia (4.3GW).\nThe energy mix of Engie Chile and AES Andes differs from Engie Brasil and Enel Colombia. Engie Brasil and Enel Colombia are more exposed to hydrological conditions, while AES Andes and Engie Chile need to deal with coal and natural gas price volatility. All the companies have predictable and robust cash flow generation since they have managed business risks properly. However, Engie Brasil has a stronger financial profile. Compared with European integrated groups with operations in Brazil, Engie Brasil's FC and LC IDRs are also two to three notches below Enel S.p.A. (BBB+/Stable) and Iberdrola, S.A. (Iberdrola; BBB+/Stable). The two European companies benefit from international footprints with large presences in higher-rated geographies - the U.K. and U.S. for Iberdrola, and Italy for Enel S.p.A. Both are fully integrated utilities that benefit from diversified profiles by business line and geography, with a significant portion of regulated networks and quasi-regulated renewable generation.\nIn energy generation, both Enel S.p.A. and Iberdrola have much higher scale compared with Engie Brasil. Iberdrola has installed capacity of 55GW and Enel S.p.A. has 81GW. -- Energy sales of 4.7 aGW in 2025 and 4.8 aGW in 2026, not including quotas capacity;\n-- Average sales price of BRL232/MWh in 2025 and BRL226/MWh in 2026;\n-- Energy purchase of 0.9 aGW in 2025 and 0.8 aGW in 2026;\n-- Selling, general and administrative expenses adjusted to inflation;\n-- Average GSF of 0.89 in 2025 and 0.91 in 2026;\n-- Capex of BRL8.3 billion from 2025 to 2027;\n-- Acquisition of the Jirau Hydropower Plant does not occur. Factors that Could, Individually or Collectively, Lead to Negative Rating Action/Downgrade:\n-- Negative rating action for the LC IDR would be associated with a deterioration in Engie Brasil's consolidated financial profile, with net adjusted leverage above 3.5x and/or funds from operations net leverage of more than 4.0x, both on a sustained basis;\n-- A downgrade on Brazil's sovereign rating would result in a similar rating action on Engie Brasil's FC IDR;\n-- A weaker operating environment in Brazil could result in a downgrade of the LC IDR;\n-- A two-notch downgrade of Engie Brasil's LC IDR may lead to a downgrade of the National Scale Rating. -- Positive rating action for the company's FC IDR would be associated with an upgrade of Brazil's sovereign rating;\n-- Positive rating action for the company's LC IDR would be associated with improvements in Brazil's operating environment;\n-- Upgrades are not applicable to the National Scale Rating, as it is at the highest level. Engie Brasil has ample access to funding sources and a strong liquidity profile, with robust cash position and no short-term debt concentration. As of Sept, 2024, cash and marketable securities of BRL4.0 billion, net of restricted cash of BRL384 million, were strong enough to cover the short-term debt of BRL2.8 billion. The high cash balance, reinforced by capex financing, will be partially used to fund the negative FCF in 2025.\nThe Asa Branca and Grauna project will require capex of BRL3.8 billion in 2025 and 2026, mostly supported by long-term project finance debt at the holding Engie Brasil level. The BRL1.5 billion debentures raised in October 2024 due in 2030 will be mainly used for capex. As of Sept. 2024, Engie Brasil's total debt of BRL24.0 billion was mainly comprised of Banco Nacional de Desenvolvimento Econônico e Social (BNDES) (BRL10.8 billion) and debentures (BRL9.0 billion). Engie Brasil is the second-largest energy generator in Brazil, with a total operational installed capacity of 9.3GW and 1.4GW under development. The company also has 2,710 km of transmission lines in operation and 1,780 km in the pre-operational phase. Net revenues and EBITDA net of construction revenues and cost. The principal sources of information used in the analysis are described in the Applicable Criteria. Click here to access Fitch's latest quarterly Global Corporates Macro and Sector Forecasts data file which aggregates key data points used in our credit analysis. Fitch's macroeconomic forecasts, commodity price assumptions, default rate forecasts, sector key performance indicators and sector-level forecasts are among the data items included. The highest level of ESG credit relevance is a score of '3', unless otherwise disclosed in this section. A score of '3' means ESG issues are credit-neutral or have only a minimal credit impact on the entity, either due to\ntheir nature or the way in which they are being managed by the entity. Fitch's ESG Relevance Scores are not inputs in the rating process; they are an observation on the relevance and materiality of ESG factors in the rating decision. For more information on Fitch's ESG Relevance Scores, visit https://www.fitchratings.com/topics/esg/products#esg-relevance-scores. Engie Brasil Energia S.A., RATING  = LT IDR. Engie Brasil Energia S.A.,  = BB+Rating Outlook Stable. Engie Brasil Energia S.A.,  = BB+Rating Outlook Stable. Engie Brasil Energia S.A., PRIOR  = BB+Rating Outlook Stable. , RATING  = LC LT IDR. ,  = BBB- Rating Outlook Stable. ,  = BBB- Rating Outlook Stable. , PRIOR  = BBB- Rating Outlook Stable. , RATING  = Natl LT. ,  = AAA(bra) Rating Outlook Stable. ,  = AAA(bra) Rating Outlook Stable. , PRIOR  = AAA(bra) Rating Outlook Stable. , RATING  = Affirmed. ,  = . ,  = . , PRIOR  = . senior unsecured, RATING  = Natl LT. senior unsecured,  = AAA(bra). senior unsecured,  = Affirmed. senior unsecured, PRIOR  = AAA(bra) Wellington Senter\nDirector\nPrimary Rating Analyst\n+55 21 4503 2606\nwellington.senter@fitchratings.com\nFitch Ratings Brasil Ltda.\nAv. Barão de Tefé, 27 - Sala 601 Saúde Rio de Janeiro, RJ 20220-460 Associate Director\nSecondary Rating Analyst\n+55 11 4504 2205\nlucas.rios@fitchratings.com Senior Director\nCommittee Chairperson\n+55 21 4503 2625\nmauro.storino@fitchratings.com New York\n+1 212 908 0526\nelizabeth.fogerty@thefitchgroup.com São Paulo\n+55 11 4504 2207\nmaggie.guimaraes@thefitchgroup.com\nAdditional information is available on www.fitchratings.com The rated entity (and/or its agents) or, in the case of structured finance, one or more of the transaction parties participated in the rating process except that the following issuer(s), if any, did not participate in the rating process, or provide additional information, beyond the issuer's available public disclosure. Corporate Hybrids Treatment and Notching Criteria (pub. 12 Nov 2020)\nNational Scale Rating Criteria (pub. 22 Dec 2020)\nParent and Subsidiary Linkage Rating Criteria (pub. 16 Jun 2023)\nSector Navigators - Addendum to the Corporate Rating Criteria (pub. 06 Dec 2024) Numbers in parentheses accompanying applicable model(s) contain hyperlinks to criteria providing description of model(s).\nCorporate Monitoring & Forecasting Model (COMFORT Model), v8.1.0 (1) Dodd-Frank Rating Information Disclosure Form\nSolicitation Status\nEndorsement Policy Engie Brasil Energia S.A.\nEU Endorsed, UK Endorsed All Fitch Ratings (Fitch) credit ratings are subject to certain limitations and disclaimers. Please read these limitations and disclaimers by following this link:\nhttps://www.fitchratings.com/understandingcreditratings. In addition, the following https://www.fitchratings.com/rating-definitions-document details Fitch's rating definitions for each rating scale and rating categories, including definitions relating to default. ESMA and the FCA are required to publish historical default rates in a central repository in accordance with Articles 11(2) of Regulation (EC)\nNo 1060/2009 of the European Parliament and of the Council of 16 September 2009 and The Credit Rating Agencies (Amendment etc.) (EU Exit) Regulations 2019 respectively.\nPublished ratings, criteria, and methodologies are available from this site at all times. Fitch's code of conduct, confidentiality, conflicts of interest, affiliate firewall, compliance, and other relevant policies and procedures are also available from the Code of Conduct section of this site. Directors and shareholders' relevant interests are available at https://www.fitchratings.com/site/regulatory. Fitch may have provided another permissible or ancillary service to the rated entity or its related third parties. Details of permissible or ancillary service(s) for which the lead analyst is based in an ESMA- or FCA-registered Fitch Ratings company (or branch of such a company) can be found on the entity summary page for this issuer on the Fitch Ratings website. In issuing and maintaining its ratings and in making other reports (including forecast information), Fitch relies on factual information it receives from issuers and underwriters and from other sources Fitch believes to be credible. Fitch conducts a reasonable investigation of the factual information relied upon by it in accordance with its ratings methodology, and obtains reasonable verification of that information from independent sources, to the extent such sources are available for a given security or in a given jurisdiction. The manner of Fitch's factual investigation and the scope of the third-party verification it obtains will vary depending on the nature of the rated security and its issuer, the requirements and practices in the jurisdiction in which the rated security is offered and sold and/or the issuer is located, the availability and nature of relevant public information, access to the management of the issuer and its advisers, the availability of pre-existing third-party verifications such as audit reports, agreed-upon procedures letters, appraisals, actuarial reports, engineering reports, legal opinions and other reports provided by third parties, the availability of independent and competent third- party verification sources with respect to the particular security or in the particular jurisdiction of the issuer, and a variety of other factors. Users of Fitch's ratings and reports should understand that neither an enhanced factual investigation nor any thirdparty verification can ensure that all of the information Fitch relies on in connection with a rating or a report will be accurate and complete. Ultimately, the issuer and its advisers are responsible for the accuracy of the information they provide to Fitch and to the market in offering documents and other reports. In issuing its ratings and its reports, Fitch must rely on the work of experts, including independent auditors with respect to financial statements and attorneys with respect to legal and tax matters. Further, ratings and forecasts of financial and other information are inherently forward-looking and embody assumptions and predictions about future events that by their nature cannot be verified as facts. As a result, despite any verification of current facts, ratings and forecasts can be affected by future events or conditions that were not anticipated at the time a rating or forecast was issued or affirmed. Fitch Ratings makes routine, commonly-accepted adjustments to reported financial data in accordance with the relevant criteria and/or industry standards to provide financial metric consistency for entities in the same sector or asset class.\nThe complete span of best- and worst-case scenario credit ratings for all rating categories ranges from ' AAA' to 'D'. Fitch also provides information on best-case rating upgrade scenarios and worst-case rating downgrade scenarios (defined as the 99th percentile of rating transitions, measured in each direction) for international credit ratings, based on historical performance. A simple average across asset classes presents best-case upgrades of 4 notches and worst-case downgrades of 8 notches at the 99th percentile. For more details on sector-specific best- and worst-case scenario credit ratings, please see Best- and Worst-Case Measures under the Rating Performance page on Fitch's website. The information in this report is provided 'as is' without any representation or warranty of any kind, and Fitch does not represent or warrant that the report or any of its contents will meet any of the requirements of a recipient of the report. A Fitch rating is an opinion as to the creditworthiness of a security. This opinion and reports made by Fitch are based on established criteria and methodologies that Fitch is continuously evaluating and updating. Therefore, ratings and reports are the collective work product of Fitch and no individual, or group of individuals, is solely responsible for a rating or a report. The rating does not address the risk of loss due to risks other than credit risk, unless such risk is specifically mentioned. Fitch is not engaged in the offer or sale of any security. All Fitch reports have shared authorship. Individuals identified in a Fitch report were involved in, but are not solely responsible for, the opinions stated therein. The individuals are named for contact purposes only. A report providing a Fitch rating is neither a prospectus nor a substitute for the information assembled, verified and presented to investors by the issuer and its agents in connection with the sale of the securities. Ratings may be changed or withdrawn at any time for any reason in the sole discretion of Fitch. Fitch does not provide investment advice of any sort. Ratings are not a recommendation to buy, sell, or hold any security. Ratings do not comment on the adequacy of market price, the suitability of any security for a particular investor, or the tax-exempt nature or taxability of payments made in respect to any security. Fitch receives fees from issuers, insurers, guarantors, other obligors, and underwriters for rating securities. Such fees generally vary from US$1,000 to US$750,000 (or the applicable currency equivalent) per issue. In certain cases, Fitch will rate all or a number of issues issued by a particular issuer, or insured or guaranteed by a particular insurer or guarantor, for a single annual fee. Such fees are expected to vary from US$10,000 to US$1,500,000 (or the applicable currency equivalent). The assignment, publication, or dissemination of a rating by Fitch shall not constitute a consent by Fitch to use its name as an expert in connection with any registration statement filed under the United States securities laws, the Financial Services and Markets Act of 2000 of the United Kingdom, or the securities laws of any particular jurisdiction. Due to the relative efficiency of electronic publishing and distribution, Fitch research may be available to electronic subscribers up to three days earlier than to print subscribers. For Australia, New Zealand, Taiwan and South Korea only: Fitch Australia Pty Ltd holds an Australian financial services license (AFS license no. 337123) which authorizes it to provide credit ratings to wholesale clients only. Credit ratings information published by Fitch is not intended to be used by persons who are retail clients within the meaning of the Corporations Act 2001.Fitch Ratings, Inc. is registered with the U.S. Securities and Exchange Commission as a Nationally Recognized Statistical Rating Organization (the 'NRSRO'). While certain of the NRSRO's credit rating subsidiaries are listed on Item 3 of Form NRSRO and as such are authorized to issue credit ratings on behalf of the NRSRO (see https://www.fitchratings.com/site/regulatory), other credit rating subsidiaries are not listed on Form NRSRO (the 'non-NRSROs') and therefore credit ratings issued by those subsidiaries are not issued on behalf of the NRSRO. However, non-NRSRO personnel may participate in determining credit ratings issued by or on behalf of the NRSRO.\ndv01, a Fitch Solutions company, and an affiliate of Fitch Ratings, may from time to time serve as loan data agent on certain structured finance transactions rated by Fitch Ratings.\nCopyright © 2025 by Fitch Ratings, Inc., Fitch Ratings Ltd. and its subsidiaries. 33 Whitehall Street, NY, NY 10004. Telephone: 1-800-753-4824, (212) 908-0500. Reproduction or retransmission in whole or in part is prohibited except by permission. All rights reserved. The ratings above were solicited and assigned or maintained by Fitch at the request of the rated entity/issuer or a related third party. Any exceptions follow below. Fitch's international credit ratings produced outside the EU or the UK, as the case may be, are endorsed for use by regulated entities within the EU or the UK, respectively, for regulatory purposes, pursuant to the terms of the EU CRA Regulation or the UK Credit Rating Agencies (Amendment etc.) (EU Exit) Regulations 2019, as the case may be. Fitch's approach to endorsement in the EU and the UK can be found on Fitch's Regulatory Affairs page on Fitch's website. The endorsement status of international credit ratings is provided within the entity summary page for each rated entity and in the transaction detail pages for structured finance transactions on the Fitch website. These disclosures are updated on a daily basis. Fitch Ratings"
]