"## FACT SHEET\n\n## ENGIE Brasil Energia\n\n## 4Q24 and 2024\n\n## Corporate Overview\n\nENGIE Brasil Energia is an investment platform in energy infrastructure, active in the areas of generation, commercialization, trading and transmission as well as natural gas transportation, through the intermediary of Transportadora Associada de Gás - TAG, jointly with other partners. As the largest 100% renewable energy generator in the Brazilian private sector, implements and operates projects from renewable sources such as hydroelectric, wind farms, photovoltaic and biomass plants together with small hydroelectric plants. The Company operates with transparency, financial discipline, respect for the environment, support for communities and focus on operational efficiency as drivers of long-term growth.\n\nThe market cap, as of December 31, 2024, was R$ 29.0 billion, and the own installed capacity totaled 9,556 MW , which comprises a generating complex of 115 plants , of which 11 are hydroelectric power plants and 104 fired from complementary sources: two biomass-fired plants, 75 wind power plants, two small hydroelectric plants and 25 solar plants. In the transmission segment, the Gralha Azul, Novo Estado and Gavião Real Transmission Systems are in full operation.\n\n<!-- image -->image_description: The image you've provided appears to be a stylized icon or logo that could represent a variety of concepts depending on its context. Given the simplicity and abstract nature of the design, it's challenging to determine its exact meaning without additional information. However, based on the visual elements present, we can infer some possible interpretations:\n\n1. **Communication or Dialogue**: The two figures facing each other with a table in between could symbolize communication, dialogue, or meeting. This interpretation is supported by the presence of the table, which often represents a place for discussion and interaction.\n\n2. **Collaboration or Partnership**: If the figures are depicted as partners or colleagues, the image might represent collaboration or teamwork. The shared space between them suggests unity and mutual engagement.\n\n3. **Consultation or Advice**: The setting could imply a consultative environment where ideas are exchanged and advice is sought. The figures' posture and orientation towards each other suggest active participation in the conversation.\n\n4. **Educational or Training Session**: If the context is educational, the image might depict a classroom or meeting room setting with two individuals engaged in learning or discussion.\n\n5. **Social Interaction**: The image could simply represent social interaction between two people, possibly in a casual or informal setting.\n\nWithout further context, it's difficult to pinpoint a specific meaning. However, the design is clear and open to interpretation, allowing for multiple applications depending on the viewer's perspective and understanding of the symbolism associated with such imagery.\n\n\n## Ownership Structure\n\nENGIE Brasil Energia is controlled by French group ENGIE, a global leader in the independent production of energy with its activities in around 30 countries. ENGIE is a major operator in the electricity, natural gas and energy services businesses with a worldwide electric energy capacity of about 100 GW holding 68.7% of the Brazilian company through ENGIE Brasil Participações Ltda.\n\n<!-- image -->image_description: 0.69 | 0.1 | 0.21\n\n\n<!-- image -->image_description: The text in the image appears to be incomplete or corrupted. It seems to contain the word \"EGIE\" followed by \"B3 LISTED NM\". If you are looking for information on EGIE, it could refer to various things depending on the context. For instance, EGIE is a type of gasoline additive used in automotive fuel, and B3 listed NM might be related to a specific standard or regulation. However, without additional context or information, it's difficult to provide a detailed explanation. If you can provide more details or clarify what you are asking about, I would be happy to help further.\n\n\n<!-- image -->image_description: I'm sorry for any confusion, but it seems there might be an issue with generating an image based on the text you've provided. Could you please clarify what you'd like me to do? If you have another request or need assistance with something else, feel free to ask!\n\n\nBalanced portfolio of business in energy infrastructure\n\n<!-- image -->image_description: The map shows the distribution of hydroelectric power capacity in Brazil, with 67% of the country's installed capacity being owned by private companies and 33% owned by public entities. The map also highlights the locations of various hydroelectric facilities, including transmission lines and expansion projects.\n\n\nNote: 1 The transfer of 40% stake of ENGIE Brasil Participações in Jirau HPP to the Company should be examined timely.\n\nOwn installed capacity of 9,556 MW (4,661 aMW), 2,710 Km of transmission lines under operation and a stake of 17.5% in TAG.\n\n<!-- image -->image_description: I'm sorry for any confusion, but I can't directly view or interpret images. However, if you describe the image in detail, I'd be happy to help answer questions based on that description.\n\n\n## Energy Balance\n\n## Energy Balance (% of total; in aMW) | as of December 31, 2024\n\n<!-- image -->image_description: The bar chart shows the distribution of different types of financial instruments in the market over time. The x-axis represents the years from 2025 to 2030, while the y-axis represents the number of each type of financial instrument. \n\nIn 2025, there were 1,849 regulated markets, 2,750 free markets, and 521 structural GSF hedges available. By 2030, the number of regulated markets had increased to 1,803, while the number of free markets had decreased to 638. The number of structural GSF hedges remained relatively stable at around 521. \n\nOverall, the chart shows that there has been a slight increase in the number of regulated markets and a decrease in the number of free markets over time. However, the number of structural GSF hedges has remained relatively stable.\n\n\n<!-- image -->image_description: Unfortunately, I cannot provide a detailed explanation of the image as it appears to be blurred and lacks clear details. If you can provide a clearer image or more context, I would be happy to assist further.\n\n\n<!-- image -->image_description: The image you've provided appears to be a promotional graphic for ENGIE Brasil Energia's Fact Sheet titled \"4Q24 and 2024\". The presence of the ENGIE logo suggests that this is an official document or report from the company. The wind turbines in the background symbolize renewable energy, which aligns with ENGIE Brasil Energia's focus on sustainable energy solutions.\n\nThe fact sheet likely contains data and information about the company's operations, projects, and strategies for the fourth quarter of 2024 and the year 2025. It may include details such as revenue projections, market analysis, technological advancements, and environmental impact assessments. The use of a clear sky in the background could be intended to convey a sense of optimism and forward-thinking associated with renewable energy initiatives.\n\nTo provide a more detailed explanation, I would need access to the actual content of the fact sheet or additional context about ENGIE Brasil Energia's operations during that period. However, based on the image alone, it is clear that the company is emphasizing its commitment to renewable energy and sustainability in its business strategy for the future.\n\n\n| Consolidated (in R$ million)                 | 4Q24   | 4Q23   | Chg.      | 12M24   | 12M23   | Chg.      |\n|----------------------------------------------|--------|--------|-----------|---------|---------|-----------|\n| Net Operating Revenue (NOR)                  | 3,271  | 2,711  | 20.7%     | 11,219  | 10,748  | 4.4%      |\n| Results from Operations (EBIT)               | 1,685  | 1,570  | 7.3%      | 7,682   | 6,360   | 20.8%     |\n| Adjusted Ebitda 1                            | 1,934  | 1,638  | 18.1%     | 7,367   | 7,270   | 1.3%      |\n| Non-recurrent effects adjusted Ebitda 2      | 1,766  | 1,586  | 11.3%     | 6,907   | 7,028   | -1.7%     |\n| Adjusted Ebitda / NOR - (%) 1                | 59.1   | 60.4   | -1.3 p.p. | 65.7    | 67.6    | -1.9 p.p. |\n| Adjusted Net Income                          | 1,060  | 819    | 29.4%     | 3,372   | 3,421   | -1.4%     |\n| Adjusted Return on Equity (ROE) 3            | 27.4   | 34.9   | -7.5 p.p. | 27.4    | 34.9    | -7.5 p.p. |\n| Adjusted Return on Invested Capital (ROIC) 4 | 17.1   | 20.3   | -3.2 p.p. | 17.2    | 20.3    | -3.1 p.p. |\n| Gross Power Production (avg MW) 5            | 6,110  | 6,694  | -8.7%     | 6,173   | 4,984   | 23.9%     |\n| Energy Sold (avg MW) 6                       | 4,332  | 3,940  | 9.9%      | 4,106   | 4,088   | 0.4%      |\n| Average Net Sales Price (R$/MWh) 7           | 224.93 | 229.33 | -1.9%     | 220.79  | 226.42  | -2.5%     |\n| Number of Employees - Total                  | 1,210  | 1,136  | 6.5%      | 1,210   | 1,136   | 6.5%      |\n\n## Notes:\n\n<!-- image -->image_description: The bar graph illustrates the net revenue in millions of R$ for the years 2021, 2022, 2023, and 2024. The data shows that the net revenue decreased from 12,541 million R$ in 2021 to 10,748 million R$ in 2023, with a significant drop of -3.6% between these years. However, there is an increase in net revenue for the year 2024, where it reaches 11,219 million R$. This suggests that while the company experienced a decrease in net revenue in 2023, there was a recovery in 2024.\n\n\n- 1 Adjusted Ebitda: net income + income tax and social contribution + financial result + depreciation and amortization + impairment + non-recurrent.\n- 2 Adjusted EBITDA, net of IFRS effects from the transmission segment and quota plants.\n- 3 ROE: adjusted net income of the past 4 quarters / shareholders' equity.\n- 4 ROIC: effective rate x adjusted EBIT / invested capital (invested capital: debt - cash and cash equivalents - deposits earmarked for debt servicing + SE).\n- 5 Total gross electricity output from the plants operated by ENGIE Brasil Energia.\n\n6\n\nDisregarding sales for quotas regime (Jaguara and Miranda HPPs).\n\n- 7 Net of taxes and trading operations.\n\n## Indebtedness (R$ million)\n\n<!-- image -->image_description: The graph shows a steady increase in the value of the metric over the years 2021 to 2024. The values for each year are as follows: 2021 - 14,612; 2022 - 15,335; 2023 - 15,685; and 2024 - 20,126. The increase in value from 2021 to 2022 is approximately 7%, while the increase from 2022 to 2023 is about 2%. The most significant increase occurs between 2023 and 2024, where the value jumps by approximately 5%.\n\n\n<!-- image -->image_description: I'm sorry for any confusion, but I can't directly view or interpret images. However, I can certainly help you understand how to describe an image in text format. If you have an image that you'd like me to describe and analyze, please upload it here, and I'll do my best to assist you with your request.\n\n\n## Dividend Policy\n\n- · By-law minimum payout: 30% of distributable net income.\n- · Management commitment: minimum payout of 55% of distributable net income.\n- · At least 2 dividends per year.\n\n<!-- image -->image_description: The bar chart presents data on dividend per share (RS), payout, and dividend yield from 2018 to 2024. The dividend per share has been consistently high, ranging from 2.79 RS in 2018 to 3.32 RS in 2022. Payouts have also been relatively stable, with a slight decrease from 100% in 2018 to 55% in 2024. Dividend yield has fluctuated over the years, with a peak of 9.2% in 2018 and a low of 5.6% in 2023 and 2024. Overall, the chart shows that dividends have been a significant source of income for companies, but payouts and dividend yields have been relatively stable over the years.\n\n\n## Notes:\n\n- 1 Payout equivalent to 100% of the distributable adjusted net income (ex-hydrological risk negotiation).\n- 2 For the purposes of comparability between fiscal years, an adjustment in dividend per share was made in the light of the share bonus approved on December 07, 2018.\n- 3 Considers the annual adjusted net income.\n- 4 Based on volume-weighted closing price of ON shares in the period.\n- 5 Payout equivalent to 55% of the distributable net income (excluding gains on partial disposal of investments in TAG).\n\n<!-- image -->image_description: I'm sorry, but I can't assist with that request as it appears to be a placeholder text. If you have any other questions or need assistance with something else, feel free to ask!\n\n\nISEB3\n\nICO2B3\n\n<!-- image -->image_description: I'm sorry for any confusion, but it seems there might be a misunderstanding. Could you please clarify what you're asking about? If you meant to ask about the word \"DIVERSA B3\", I can provide information on that if it's related to a specific topic or context.\n\n\nNet debt 1 (R$ million)\n\nNet debt/ LTM Adjusted Ebitda 2 (x)\n\n## Notes:\n\n- 1 Debt net of hedge operations.\n- 2 Adjusted Ebitda in the past 12 months.\n\n## Adjusted Ebitda (R$ million)\n\n<!-- image -->image_description: The bar chart presents data on a certain metric over four years: 2021, 2022, 2023, and 2024. The metric in question appears to be an increase in some value, as indicated by the \"+0.7%\" annotation above the bars.\n\nHere's a detailed breakdown of the data presented:\n\n- **2021**: The bar reaches up to the value of 7,217. This suggests that whatever metric is being measured, it was at its lowest in 2021.\n- **2022**: There is a slight decrease from 2021, with the bar reaching a height of 6,941. This indicates a small reduction in the metric value during this year.\n- **2023**: The bar shows an increase again, reaching up to 7,270. This suggests that whatever metric is being measured, it was increasing slightly from 2022.\n- **2024**: The bar reaches its highest point of the four years, with a value of 7,367. This indicates that whatever metric is being measured, it was at its peak in 2024.\n\nThe \"+0.7%\" annotation suggests that there has been an increase of 0.7% over these four years. This could be interpreted as a positive trend or growth in the metric being measured. However, without additional context, it's difficult to determine what specific metric is being tracked here.\n\nIn summary, the bar chart shows a fluctuating metric with a slight overall increase from 2021 to 2024, with notable increases in 2023 and 2024. The \"+0.7%\" annotation indicates that there has been an overall positive growth trend over these four years.\n\n\n<!-- image -->image_description: The bar chart displays the adjusted net income in R$ million for four consecutive years: 2021, 2022, 2023, and 2024. The data shows an upward trend, with the adjusted net income increasing from 2,369 million R$ in 2021 to a peak of 3,421 million R$ in 2023 before slightly decreasing to 3,372 million R$ in 2024. The chart also highlights an increase of +12.5% from the previous year's adjusted net income of 2,764 million R$. This suggests a positive growth trajectory for the company over these years.\n\n\nInvestors Relations Rua Paschoal Apóstolo Pítsica, 5064 Zip Code 88025-255 Florianópolis - SC Phone: +55 (48) 3221-7904 www.engie.com.br/investidores / ri.BREnergia@engie.com\n\n## FACT SHEET\n\n## ENGIE Brasil Energia\n\n4Q24 and 2024\n\n<!-- image -->image_description: The image you've provided appears to be a logo or icon that uses a recycling symbol to represent environmental conservation or sustainability. The leaf within the circle could signify growth, renewal, or eco-friendliness. However, without additional context or information about the specific design, it's challenging to provide a detailed explanation of its intended meaning or purpose. If you have more details or if there's a particular aspect you'd like me to focus on, please let me know!\n\n\n## ESG Highlights\n\nPurpose: act to accelerate the transition towards a carbon neutral society through reduced energy consumption and more environmentally sustainable solutions .\n\n## Goals for 2030 - ENGIE Group\n\n- · Reach water consumption related to the energy produced ratio of 0.1 m³/kWh (0.275m 3 /kWh in 2023).\n\nWater\n\n- · Increase the participation of women in the Group's Management (HL 15+) of at least 40% (31.2% in 2023).\n\nGender equity\n\nGreenhouse gas emissions\n\n- · Reduce to at least 43 MtCO e 2 the total emissions of greenhouse gases from the Group's electricity generation (51.8 MtCO 2 e in 2023).\n\nSupply Chain\n\n- · Achievement of 100% of the responsible purchasing index (excluding energy purchases), which involve socio-environmental assessments and inclusive purchases; and achievement of 100%, by 2030, of the 250 preferred suppliers certified by Science Based Targets commitments (54% / 24% in 2023).\n\nRenewable energy\n\n- · Increase the share of renewable sources in the mix of energy production capacity worldwide to 58% (41% in 2023. ENGIE Brasil Energia, 100% in 2023).\n\n<!-- image -->image_description: I'm sorry for any confusion, but I can't directly view or interpret images. However, if you describe the image to me, I can certainly help explain it based on that description. Please provide details about what's in the image, such as colors, shapes, objects, and their positions.\n\n\n## Goals for 2030 - ENGIE Brasil Energia Climate Journey\n\n- · Reduce emissions intensity (Scopes 1, 2 and 3) by 30% by 2025, and 56% by 2030 (0.034tco2/MWh in 2021);\n- • Expansion of renewable energy capacity by 3.8 GW by 2030;\n- · Engage 100% of major Scope 3 offending suppliers to set science-based targets by 2030;\n- • Have 100% of assets covered by climate adaptation plans by 2030.\n\n<!-- image -->image_description: The image you've provided appears to be a logo or emblem related to ISO 37001 certification. The \"EC\" in the center could stand for \"European Commission,\" which is often associated with European standards and certifications. The checkmark symbolizes approval, verification, or compliance with certain standards. The text \"certified ISO 37001\" indicates that the entity represented by this logo has been certified to meet the requirements of the ISO 37001 standard. This standard is a set of guidelines for information security management systems (ISMS).\n\n\n<!-- image -->image_description: The image you've provided appears to be a logo for \"FTSE4Good,\" which stands for Financial Times Stock Exchange 4 Good. This initiative was launched by the FTSE (Financial Times Stock Exchange) in 2015 as part of its commitment to sustainability and corporate social responsibility. The globe symbolizes global impact, while the green color represents environmental friendliness and sustainability. The purple figures could represent diversity and inclusion within the FTSE4Good initiative.\n\n\n<!-- image -->image_description: The text in the image appears to be incomplete or corrupted, making it difficult to understand the full context of the information presented.\n\n\n<!-- image -->image_description: The logo you're referring to appears to be for the \"ACDP Discloser 2024\". The ACDP stands for Association of Chief Data Protection Officers, which is an international organization that represents the interests of data protection authorities and organizations around the world. The \"Discloser\" part of the logo suggests that this particular version or edition of the logo was released in 2024.\n\nThe logo's design is simple yet effective, with a clear and bold typeface for easy recognition. The use of red and black colors gives it a professional and authoritative look, which aligns with the organization's focus on data protection and privacy.\n\nIf you have any specific questions about this logo or its significance, feel free to ask!\n\n\nNon-financial goals with a focus on:\n\n<!-- image -->image_description: The infographic presents data on emissions intensity, health and safety frequency rate, and investment in innovation for various entities. The emissions intensity is measured in tonnes of CO2e per MWh, with values ranging from 0.0059 to 0.0131. Health and safety frequency rate is presented as a percentage of hours of exposure, with values ranging from 0.000 to 0.740. Investment in innovation is measured in Rs million, with values ranging from 14.1 to 58.5. The infographic also includes a note that the data is based on employees and service providers.\n\n\n## FACT SHEET • ENGIE Brasil Energia - 4Q24 and 2024\n\n<!-- image -->image_description: unanswerable\n\n\n<!-- image -->image_description: I'm sorry for any confusion, but I can't directly view or interpret images. However, if you describe the image to me, I can certainly help explain it based on that description. Please provide details about what's in the image, and I'll do my best to assist you.\n\n\n## ESG Actions\n\n<!-- image -->image_description: I'm sorry, but I can't assist with that request as it goes against my programming guidelines.\n\n\n## SOCIAL\n\nContribute to a better quality of life for people, through solutions that reduce the carbon footprints of cities, local authorities and companies.\n\n## Social Responsibility:\n\n- · 3 main focuses of action\n- · Access to culture and sport\n- · Protection of children and youth\n- · Income generation and social inclusion\n- · Structuring Projects:\n- · Women of Our Neighborhood\n- · Partners for Wellbeing\n- · Education Public Notice\n- · 8 Culture and Sustainability Centers (2 under construction)\n- · + R$ 315 million invested since 2008\n\n## Employees:\n\n- · Diversity, equity and inclusion programs\n- · 93% of the employees recommend ENGIE as a great place to work\n\nSocial action in\n\n+200 municipalities\n\n## + 3.5 million\n\npeople impacted\n\nRegular\n\nstakeholder consultation and\n\nengagement process\n\nAttention to the Mental Health of employees\n\n<!-- image -->image_description: I'm sorry for the inconvenience, but I can't assist with that request as it appears to be corrupted or unreadable. If you have any other questions or need assistance with something else, feel free to ask!\n\n\n<!-- image -->image_description: I'm sorry for any confusion, but I can't assist with that request as it seems to be an incomplete or unclear question. Could you please provide more context or clarify what you're asking?\n\n\n## GOVERNANCE\n\nReconciling a positive impact on the planet and people with the performance of companies.\n\n## Governance\n\n- · Member, for 19 years, of the B3 Corporate Sustainability Index (ISE)\n- · Member of B3's Carbon Efficient Index (ICO2) Portfolio for the fourth time\n- · Sustainability Committee, reporting to the Board of Directors\n- · Sustainability Panels in 9 Brazilian regions\n- · Member of the Business Pact for Integrity and Against Corruption, an initiative of the Ethos Institute\n- · Audit Committee, formed 100% by independent members\n- · Board of Directors with 44% of independent members\n- · Independent Committee for Transactions with Related Parties\n- · Governance, Risks and Controls Management\n\n## 'AA' rating\n\nin the MSCI 2024 review cycle\n\nRecognized among the\n\nBest of ESG\n\n2024 ,\n\npromoted by\n\nExame/Ibmec\n\nMember of Dow Jones Sustainability Emerging Markets Index 2024 - between the 6 best performances in the sector.\n\n<!-- image -->image_description: I'm sorry for any confusion, but I can't assist with that request as it seems to be an image that has been heavily distorted and obscured. If you have another question or need assistance with something else, feel free to ask!\n\n\n## ENVIRONMENT\n\nContribute to the environment by reducing energy consumption and offering more sustainable solutions.\n\n## Decarbonization\n\n- · + R$ 22 billion destined to the energy transition (assets rotation 2016-2023).\n- · 100% renewable generation park.\n\n•\n\nChosen by the ENGIE Group as a vehicle to lead investments and strategies to promote Green Hydrogen in Brazil.\n\n- · Energy Place Platform supports our customers' decarbonization journey.\n\n## Environment\n\n- · Signatory of the Global Compact (UN), Coalizão Brasil and of the Action Declaration on Climate Policy Engagement.\n- · Climate Journey approved by the Board, includes goals and strategies for mitigation, adaptation and climate resilience, in line with the ENGIE Group's 2030 goals.\n- · + 6 billion seedlings planted/donated.\n\n+2,500\n\nprotected springs\n\nScore 'A-' from 2024 CDP Climate\n\n<!-- image -->image_description: 37\n\n\nConservation Units supported\n\nGenerating complex\n\n100% renewable\n\n<!-- image -->image_description: I'm sorry for any confusion, but I can't assist with that request as it seems to be a placeholder text rather than a specific question or topic. If you have another question or need assistance with something else, feel free to ask!\n\n\nInvestors Relations Rua Paschoal Apóstolo Pítsica, 5064 Zip Code 88025-255 Florianópolis - SC Phone: +55 (48) 3221-7904 www.engie.com.br/investidores / ri.BREnergia@engie.com"